app/views/proyectos/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user %>
    <%= form.collection_select :user_id, User.all, :id, :username,{prompt:true,autofocus: true ,class:"form-control"},class:"form-control"%>