app/views/tareas/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user_id ,:class => "col-sm-2 col-form-label"%>
    <%= form.collection_select :user_id, User.all, :id, :username,{prompt:true,autofocus: true ,class:"col-sm-10 form-control"},class:"col-sm-10 form-control"%>

SELECT "categoria".* FROM "categoria"
---
    <%= form.label :categoria_id ,:class => "col-sm-2 col-form-label"%>
      <%= form.collection_select :categoria_id, Categoria.all, :id, :nombre,{prompt:true,autofocus: true ,class:"col-sm-10 form-control"},class:"col-sm-10 form-control"%>

SELECT "proyectos".* FROM "proyectos"
---
    <%= form.label :proyecto_id ,:class => "col-sm-2 col-form-label"%>
    <%= form.collection_select :proyecto_id, Proyecto.all, :id, :nombre,{prompt:true,autofocus: true ,class:"col-sm-10 form-control"},class:"form-control"%>

SELECT "estados".* FROM "estados"
---
      <%= form.label :estado_id ,:class => "col-sm-2 col-form-label"%>
      <%= form.collection_select :estado_id, Estado.all, :id, :estado,{class:"col-sm-10 form-control"},class:"col-sm-10 form-control"%>