app/controllers/estados_controller.rb

SELECT "estados".* FROM "estados"
---
  def index
    @estados = Estado.all

INSERT INTO "estados" ("estado", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["estado", "Creada"], ["created_at", "2017-08-30 19:32:40.483234"], ["updated_at", "2017-08-30 19:32:40.483234"]]
---
  def create
    @estado = Estado.new(estado_params)

    respond_to do |format|
      if @estado.save

SELECT  "estados".* FROM "estados" WHERE "estados"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_estado
      @estado = Estado.find(params[:id])