app/controllers/home_controller.rb

SELECT  "tareas".* FROM "tareas" WHERE ("tareas"."user_id" = $1 AND "tareas"."estado_id" = 2 OR "tareas"."user_id" = $2 AND "tareas"."estado_id" = 1) LIMIT $3  [["user_id", 3], ["user_id", 3], ["LIMIT", 10]]
---
  def index
    @iniciadas = current_user.tareas.where(:estado=>3).limit(10) #iniciadas