app/controllers/home_controller.rb

  def index
    @iniciadas = current_user.tareas.where(:estado=>3).order(:fecha_fin).limit(10) #iniciadas
    @asignadas = current_user.tareas.where(:estado=>2).or(current_user.tareas.where(:estado=>1)).order(:fecha_fin).limit(10) #asignadas
    @terminadas = current_user.tareas.where(:estado=>4).order(:fecha_fin).limit(10) #terminadas
    @no_asignadas = Tarea.where(:user_id=>nil).limit(10)
---
SELECT  "tareas".* FROM "tareas" WHERE ("tareas"."user_id" = $1 AND "tareas"."estado_id" = 2 OR "tareas"."user_id" = $2 AND "tareas"."estado_id" = 1) ORDER BY "tareas"."fecha_fin" ASC LIMIT $3  [["user_id", 3], ["user_id", 3], ["LIMIT", 10]]
SELECT  "tareas".* FROM "tareas" WHERE "tareas"."user_id" IS NULL LIMIT $1  [["LIMIT", 10]]