app/controllers/proyectos_controller.rb

SELECT "proyectos".* FROM "proyectos"
---
  def index
    @proyectos = Proyecto.all

INSERT INTO "proyectos" ("nombre", "urlgithub", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "AGORA"], ["urlgithub", "https://github.com/maxantonio/agora"], ["user_id", 1], ["created_at", "2017-08-30 19:26:15.642232"], ["updated_at", "2017-08-30 19:26:15.642232"]]
---
  def create
    @proyecto = Proyecto.new(proyecto_params)

    respond_to do |format|
      if @proyecto.save

SELECT  "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_proyecto
      @proyecto = Proyecto.find(params[:id])