app/controllers/tareas_controller.rb

  def historicos
    @tareas = Tarea.where(:estado=>4).order('fecha_fin DESC')
---
SELECT "tareas".* FROM "tareas" WHERE "tareas"."estado_id" = 4 ORDER BY "tareas"."fecha_fin" ASC, pura

  def otros
    @tareas = Tarea.where('estado_id<>4').order('fecha_fin DESC')
---
SELECT "tareas".* FROM "tareas" WHERE (estado_id<>4) ORDER BY fecha_fin DESC

  def index
    @tareas = Tarea.all
---
SELECT "tareas".* FROM "tareas"

  def iniciar
    @tarea.estado_id = 3 # estado iniciada
    @tarea.fecha_inicio = Date.today
    @tarea.save()
---
UPDATE "tareas" SET "estado_id" = $1, "fecha_inicio" = $2, "updated_at" = $3 WHERE "tareas"."id" = $4  [["estado_id", 3], ["fecha_inicio", "2017-08-31"], ["updated_at", "2017-08-31 18:15:37.229033"], ["id", 1]]

  def terminar
    @tarea.estado_id = 4 # estado iniciada
    @tarea.fecha_fin_real = Date.today
    @tarea.save()
---
UPDATE "tareas" SET "estado_id" = $1, "fecha_fin_real" = $2, "updated_at" = $3 WHERE "tareas"."id" = $4  [["estado_id", 4], ["fecha_fin_real", "2017-08-31"], ["updated_at", "2017-08-31 18:16:56.151334"], ["id", 1]]

  def create
    @tarea = Tarea.new(tarea_params)

    respond_to do |format|
      if @tarea.save
---
INSERT INTO "tareas" ("nombre", "categoria_id", "estado_id", "fecha_asignacion", "fecha_fin", "proyecto_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @tarea.update(tarea_params)
---
UPDATE "tareas" SET "fecha_asignacion" = $1, "updated_at" = $2 WHERE "tareas"."id" = $3  [["fecha_asignacion", "2017-08-29"], ["updated_at", "2017-08-31 18:15:55.980461"], ["id", 1]]

    def set_tarea
      @tarea = Tarea.find(params[:id])
---
SELECT  "tareas".* FROM "tareas" WHERE "tareas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]