app/controllers/users_controller.rb

  def update
    if params[:user][:password].blank?
      params[:user].delete(:password)
      params[:user].delete(:password_confirmation)
    end

    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "username" = $1, "first_name" = $2, "last_name" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["username", "Disturbe"], ["first_name", "Yoidel"], ["last_name", "Baquero"], ["updated_at", "2017-08-29 20:34:20.564951"], ["id", 1]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]